"""
    Python中常用的7大种，8小种数据类型：
        数值类型：
        1、整数类型：int
        2、浮点类型： float
        ————————————————————————————————————————
        3、字符串类型: str
        4、布尔类型: bool
        ————————————————————————————————————————
        5、列表类型：list，里面的数据支持增删改查
        6、元组类型：tuple，一旦写入成功，不能修改和删除
        7、字典类型：dict,{'name':'Tom','age':23}
        8、集合类型：set,天生去重
"""
# list --数组
a = [1, 2, 3, 3]
print(type(a))

# tuple --元组
b = ([1, 2, 3], [4, 5, 6])
print(type(b))

# dict --字典：键值对
c = {'name': 'ljk', 'age': 32}
print(type(c))

# set --集合
d = {1, 2, 3, 4, 5, 4, 7}
print(type(d))